apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_rcc.h
/****************************************************************************
 *  arch/arm/src/stm32/hardware/stm32g47xxx_rcc.h
 *  Register offsets, addresses, and bitfield defines for STM32G47xxx RCC
 *
 *  Licensed to the Apache Software Foundation (ASF) under one or more
 *  contributor license agreements.  See the NOTICE file distributed with
 *  this work for additional information regarding copyright ownership.  The
 *  ASF licenses this file to you under the Apache License, Version 2.0 (the
 *  "License"); you may not use this file except in compliance with the
 *  License.  You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 *  License for the specific language governing permissions and limitations
 *  under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32_HARDWARE_STM32G47XXX_RCC_H
#define __ARCH_ARM_SRC_STM32_HARDWARE_STM32G47XXX_RCC_H

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Abbreviations:
 * HSE - High Speed External (clock)
 * HSI - High Speed Internal (clock)
 * POR - Power On Reset
 * RCC - Reset and Clock Control
 */

/* Register Offsets *********************************************************/

#define STM32_RCC_CR_OFFSET            0x0000              /* RCC Clock Control */
#define STM32_RCC_ICSCR_OFFSET         0x0004              /* RCC Internal Clock Sources Calibration */
#define STM32_RCC_CFGR_OFFSET          0x0008              /* RCC Clock Configuration */
#define STM32_RCC_PLLCFGR_OFFSET       0x000c              /* RCC PLL configuration register */
                                                           /* Offset 0x0010 Reserved */
                                                           /* Offset 0x0014 Reserved */
#define STM32_RCC_CIER_OFFSET          0x0018              /* RCC Clock Interrupt Enable */
#define STM32_RCC_CIFR_OFFSET          0x001c              /* RCC Clock Interrupt Flag */
#define STM32_RCC_CICR_OFFSET          0x0020              /* RCC Clock Interrupt Clear */
                                                           /* Offset 0x0024 Reserved */
#define STM32_RCC_AHB1RSTR_OFFSET      0x0028              /* RCC AHB1 Peripheral Reset */
#define STM32_RCC_AHB2RSTR_OFFSET      0x002c              /* RCC AHB2 Peripheral Reset */
#define STM32_RCC_AHB3RSTR_OFFSET      0x0030              /* RCC AHB3 Peripheral Reset */
                                                           /* Offset 0x0034 Reserved */
#define STM32_RCC_APB1RSTR1_OFFSET     0x0038              /* RCC APB1 Peripheral Reset Register 1 */
#define STM32_RCC_APB1RSTR2_OFFSET     0x003c              /* RCC APB1 Peripheral Reset Register 2 */
#define STM32_RCC_APB2RSTR_OFFSET      0x0040              /* RCC APB2 Peripheral Reset */
                                                           /* Offset 0x0044 Reserved */
#define STM32_RCC_AHB1ENR_OFFSET       0x0048              /* RCC AHB1 Peripheral Clock Enable */
#define STM32_RCC_AHB2ENR_OFFSET       0x004c              /* RCC AHB2 Peripheral Clock Enable */
#define STM32_RCC_AHB3ENR_OFFSET       0x0050              /* RCC AHB3 Peripheral Clock Enable */
                                                           /* Offset 0x0054 Reserved */
#define STM32_RCC_APB1ENR1_OFFSET      0x0058              /* RCC APB1 Peripheral Clock Enable Register 1 */
#define STM32_RCC_APB1ENR2_OFFSET      0x005c              /* RCC APB1 Peripheral Clock Enable Register 2 */
#define STM32_RCC_APB2ENR_OFFSET       0x0060              /* RCC APB2 Peripheral Clock Enable */
                                                           /* Offset 0x0064 Reserved */
#define STM32_RCC_AHB1SMENR_OFFSET     0x0068              /* RCC AHB1 Peripheral Clock Enable in Sleep/Stop Modes */
#define STM32_RCC_AHB2SMENR_OFFSET     0x006c              /* RCC AHB2 Peripheral Clock Enable in Sleep/Stop Modes */
#define STM32_RCC_AHB3SMENR_OFFSET     0x0070              /* RCC AHB3 Peripheral Clock Enable in Sleep/Stop Modes */
                                                           /* Offset 0x0074 Reserved */
#define STM32_RCC_APB1SMENR1_OFFSET    0x0078              /* RCC APB1 Peripheral Clock Enable in Sleep/Stop Modes (1 of 2) */
#define STM32_RCC_APB1SMENR2_OFFSET    0x007c              /* RCC APB1 Peripheral Clock Enable in Sleep/Stop Modes (2 of 2) */
#define STM32_RCC_APB2SMENR_OFFSET     0x0080              /* RCC APB2 Peripheral Clock Enable in Sleep/Stop Modes */
                                                           /* Offset 0x0084 Reserved */
#define STM32_RCC_CCIPR_OFFSET         0x0088              /* RCC Peripherals Independent Clock Configuration (1 of 2, see CCIPR2) */
                                                           /* Offset 0x008c Reserved */
#define STM32_RCC_BDCR_OFFSET          0x0090              /* RCC RTC Domain Control Register */
#define STM32_RCC_CSR_OFFSET           0x0094              /* RCC Clock Control / Status Register */
#define STM32_RCC_CRRCR_OFFSET         0x0098              /* RCC Clock Recovery RC Register */
#define STM32_RCC_CCIPR2_OFFSET        0x009c              /* RCC Peripherals Independent Clock Configuration (2 of 2, see CCIPR) */

/* Register Addresses *******************************************************/

#define STM32_RCC_CR                   (STM32_RCC_BASE + STM32_RCC_CR_OFFSET)
#define STM32_RCC_ICSCR                (STM32_RCC_BASE + STM32_RCC_ICSCR_OFFSET)
#define STM32_RCC_CFGR                 (STM32_RCC_BASE + STM32_RCC_CFGR_OFFSET)
#define STM32_RCC_PLLCFGR              (STM32_RCC_BASE + STM32_RCC_PLLCFGR_OFFSET)
#define STM32_RCC_CIER                 (STM32_RCC_BASE + STM32_RCC_CIER_OFFSET)
#define STM32_RCC_CIFR                 (STM32_RCC_BASE + STM32_RCC_CIFR_OFFSET)
#define STM32_RCC_CICR                 (STM32_RCC_BASE + STM32_RCC_CICR_OFFSET)
#define STM32_RCC_AHB1RSTR             (STM32_RCC_BASE + STM32_RCC_AHB1RSTR_OFFSET)
#define STM32_RCC_AHB2RSTR             (STM32_RCC_BASE + STM32_RCC_AHB2RSTR_OFFSET)
#define STM32_RCC_AHB3RSTR             (STM32_RCC_BASE + STM32_RCC_AHB3RSTR_OFFSET)
#define STM32_RCC_APB1RSTR1            (STM32_RCC_BASE + STM32_RCC_APB1RSTR1_OFFSET)
#define STM32_RCC_APB1RSTR2            (STM32_RCC_BASE + STM32_RCC_APB1RSTR2_OFFSET)
#define STM32_RCC_APB2RSTR             (STM32_RCC_BASE + STM32_RCC_APB2RSTR_OFFSET)
#define STM32_RCC_AHB1ENR              (STM32_RCC_BASE + STM32_RCC_AHB1ENR_OFFSET)
#define STM32_RCC_AHB2ENR              (STM32_RCC_BASE + STM32_RCC_AHB2ENR_OFFSET)
#define STM32_RCC_AHB3ENR              (STM32_RCC_BASE + STM32_RCC_AHB3ENR_OFFSET)
#define STM32_RCC_APB1ENR1             (STM32_RCC_BASE + STM32_RCC_APB1ENR1_OFFSET)
#define STM32_RCC_APB1ENR2             (STM32_RCC_BASE + STM32_RCC_APB1ENR2_OFFSET)
#define STM32_RCC_APB2ENR              (STM32_RCC_BASE + STM32_RCC_APB2ENR_OFFSET)
#define STM32_RCC_AHB1SMENR            (STM32_RCC_BASE + STM32_RCC_AHB1SMENR_OFFSET)
#define STM32_RCC_AHB2SMENR            (STM32_RCC_BASE + STM32_RCC_AHB2SMENR_OFFSET)
#define STM32_RCC_AHB3SMENR            (STM32_RCC_BASE + STM32_RCC_AHB3SMENR_OFFSET)
#define STM32_RCC_APB1SMENR1           (STM32_RCC_BASE + STM32_RCC_APB1SMENR1_OFFSET)
#define STM32_RCC_APB1SMENR2           (STM32_RCC_BASE + STM32_RCC_APB1SMENR2_OFFSET)
#define STM32_RCC_APB2SMENR            (STM32_RCC_BASE + STM32_RCC_APB2SMENR_OFFSET)
#define STM32_RCC_CCIPR                (STM32_RCC_BASE + STM32_RCC_CCIPR_OFFSET)
#define STM32_RCC_BDCR                 (STM32_RCC_BASE + STM32_RCC_BDCR_OFFSET)
#define STM32_RCC_CSR                  (STM32_RCC_BASE + STM32_RCC_CSR_OFFSET)
#define STM32_RCC_CRRCR                (STM32_RCC_BASE + STM32_RCC_CRRCR_OFFSET)
#define STM32_RCC_CCIPR2               (STM32_RCC_BASE + STM32_RCC_CCIPR2_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* CR - Clock Control Register */

#define RCC_CR_HSION                   (1 << 8)            /* Bit  8: HSI16 clock enable */
#define RCC_CR_HSIKERON                (1 << 9)            /* Bit  9: HSI16 always enable for peripheral kernel */
#define RCC_CR_HSIRDY                  (1 << 10)           /* Bit 10: HSI16 clock ready flag */
#define RCC_CR_HSEON                   (1 << 16)           /* Bit 16: HSE clock enable */
#define RCC_CR_HSERDY                  (1 << 17)           /* Bit 17: HSE clock ready flag */
#define RCC_CR_HSEBYP                  (1 << 18)           /* Bit 18: HSE crystal oscillator bypass */
#define RCC_CR_CSSON                   (1 << 19)           /* Bit 19: HSE clock security system enable */
#define RCC_CR_PLLON                   (1 << 24)           /* Bit 24: Main PLL enable */
#define RCC_CR_PLLRDY                  (1 << 25)           /* Bit 25: Main PLL ready */

#define RCC_CR_RESERVED_MASK           0xfcf0f8ff          /* Bits 31-26, 23-20, 15-11, and 7-0 should be kept at reset value */
#define RCC_CR_RESET                   0x00000063          /* Value at POR */

/* ICSCR - Internal Clock Sources Calibration Register */

#define RCC_ICSCR_HSICAL_SHIFT         (16)                /* Bits 23-16: HSI16 calibration (factory programmed, read only) */
#define RCC_ICSCR_HSICAL_MASK          (0xff << RCC_ICSCR_HSICAL_SHIFT)

